// دستی اصلاح شده و در menuslice استفاده شده 
export const Categories = [
    {
      id: 1,
      "main-title": "موبایل",
      generalLink: "همه محصولات موبایل",
      url: {
        base: null,
        uri: "/landing/mobile/",
      },
      image: "/images/logo/megamenu/mobile.svg",
      children: [
        {
          id: 1,
          title: "برندهای مختلف گوشی موبایل",
          items: [
            "گوشی آیفون",
            "گوشی سامسونگ",
            "گوشی شیائومی",
            "گوشی نوکیا",
            "گوشی آنر",
            "گوشی ناتینگ فون",
            "گوشی ریلمی",
            "گوشی وکال",
            "گوشی ردتون",
            "گوشی تی سی ال",
            "گوشی هواوی",
            "گوشی داریا",
            "گوشی گوگل پیکسل",
            "گوشی جی ال ایکس",
            "گوشی آلکاتل",
            "گوشی وان پلاس",
            "گوشی های جنرال لوکس",
            "گوشی موبایل دوجی",
            "گوشی بلک ویو",
            "گوشی HMD",
            "قیمت گوشی",
          ],
        },
        {
          id: 2,
          title: "برندهای برتر",
          items: ["سامسونگ", "اپل", "ردتون", "آنر", "ریلمی"],
        },
        {
          id: 3,
          title: "گوشی براساس قیمت",
          items: ["گوشی ارزان", "گوشی موبایل قسطی", "گوشی تا ۲ میلیون تومان", "گوشی تا ۵ میلیون تومان", "گوشی تا ۷ میلیون تومان", "گوشی تا ۱۵ میلیون تومان", "گوشی بالای ۱۵ میلیون تومان"],
        },
        {
          id: 4,
          title: "گوشی براساس عملکرد",
          items: ["گوشی گیمینگ", "گوشی 5G", "گوشی دکمه‌ای", "گوشی ضد آب", "گوشی مناسب عکاسی", "گوشی میان رده", "گوشی دانش آموزی", "گوشی پرچمدار", "گوشی دوسیمکارت"],
        },
        {
          id: 5,
          title: "گوشی براساس حافظه داخلی",
          items: ["گوشی 64 گیگابایت", "گوشی 128 گیگابایت", "گوشی 256 گیگابایت", "گوشی 512 گیگابایت", "گوشی یک ترابایت"],
        },
        {
          id: 6,
          title: "رزولوشن عکس",
          items: ["گوشی با دوربین 48 مگاپیکسل", "گوشی با دوربین 50 مگاپیکسل", "گوشی با دوربین 64 مگاپیکسل", "گوشی با دوربین 108 مگاپیکسل"],
        },
        {
          id: 7,
          title: "لوازم جانبی موبایل",
          items: ["شارژر گوشی", "شارژر وایرلس", "قاب و کاور گوشی", "گلس گوشی", "هولدر گوشی موبایل", "کابل شارژر و مبدل", "پاوربانک (شارژر همراه)", "مونوپاد"],
        },
        {
          id: 8,
          title: "تبلت",
        },
        {
          id: 9,
          title: "هدفون",
          items: ["هدفون بی سیم", "هدفون اپل (ایرپاد)", "هدفون بیتس", "هدفون سونی", "هدفون سامسونگ (ایربادز)", "هدفون شیائومی", "هدفون جی بی ال", "هدفون انکر"],
        },
        {
          id: 10,
          title: "ساعت و مچ بند هوشمند",
          items: ["ساعت هوشمند سامسونگ", "ساعت هوشمند شیائومی"],
        },
        {
          id: 11,
          title: "اپل واچ",
          items: ["اپل واچ اولترا ۲", "اپل واچ ۱۰", "اپل واچ SE"],
        },
        {
          id: 12,
          title: "داغ ترین ها",
          items: [
            "کوشی S25 سامسونگ",
            "آیفون ۱۶",
            "آیفون ۱۶ پرو",
            "آیفون ۱۶ پرومکس",
            "شیائومی نوت ۱۴",
            "ردمی نوت ۱۴ پرو",
            "ردمی نوت ۱۴ پرو پلاس",
            "شارژر فندکی",
            "هولدر گردنی",
            "آیفون ۱۳",
            "آیفون ۱۲",
            "آیفون ۱۱",
            "گوشی سامسونگ سری s",
            "گوشی سامسونگ سری a",
            "گوشی سامسونگ سری m",
            "کاور ایرپاد",
            "داریا باند 5G",
            "گلکسی S23 Ultra",
            "ردمی نوت ۱۲",
            "گلکسی S23 FE",
            "پوکو x7 پرو",
            "گلکسی A56",
            "قاب گوشی سامسونگ",
            "قاب گوشی آیفون",
          ],
        },
      ],
    },
    {
      id: 2,
      "main-title": "کالای دیجیتال",
      generalLink: "همه محصولات کالای دیجیتال",
      url: {
        base: null,
        uri: "/main/electronic-devices/",
      },
      image: "/images/logo/megamenu/digital.svg",
      children: [
        {
          id: 1,
          title: "لپ تاپ",
          items: ["لپ تاپ ایسوس", "لپ تاپ لنوو", "مک بوک", "لپ تاپ HP", "لپ تاپ دل", "لپ تاپ ایسر", "لپ تاپ ام اس آی", "لپ تاپ ROG", "لپ تاپ TUF Gaming", "لپ تاپ LOQ", "لپ تاپ ideapad slim 3", "لپ تاپ Vivobook", "لپ تاپ Victus", "لپ تاپ کاستوم", "لپ تاپ استوک"],
        },
        {
          id: 2,
          title: "لوازم جانبی لپ تاپ",
          items: ["شارژر لپ تاپ", "کیف لپ تاپ"],
        },
        {
          id: 3,
          title: "کنسول بازی",
          items: ["ps5", "ps5 slim", "ps4", "xbox", "gamestick", "nintendo switch"],
        },
        {
          id: 4,
          title: "وسایل گیمینگ",
          items: ["ست گیمینگ", "دسته بازی", "گوشی دکمه‌ای", "بازی ps5", "بازی ps4", "بازی ایکس باکس ۳۶۰", "بازی pc", "دیسک های بازی", "فرمان بازی", "صندلی گیمینگ"],
        },
        {
          id: 5,
          title: "کامپیوتر",
          items: ["all in one", "mini pc", "قلم نوری", "رم ریدر", "ماوس پد", "کیس اسمبل شده"],
        },
        {
          id: 6,
          title: "کیبورد",
        },
        {
          id: 7,
          title: "کیس کامپیوتر",
        },
        {
          id: 8,
          title: "ماوس",
        },
        {
          id: 9,
          title: "مانیتور",
          items: ["مانیتور OLED"],
        },
        {
          id: 10,
          title: "اسپیکر",
          items: ["اسپیکر بلوتوثی", "اسپیکر jbl", "اسپیکر هارمن کاردن", "اسپیکر سونی", "اسپیکر تسکو", "اسپیکر مکسیدر", "اسپیکر میکرولب", "پارتی باکس"],
        },
        {
          id: 11,
          title: "قطعات کامپیوتر",
          items: ["پردازنده (cpu)", "کارت گرافیک", "مادربرد", "دانگل بلوتوث"],
        },
        {
          id: 12,
          title: "رم کامپیوتر",
        },
        {
          id: 13,
          title: "هدفون",
          items: ["هدفون بی سیم", "هدفون گیمینگ", "هدفون اپل (ایرپاد)", "هدفون بیتس", "هدفون سونی", "هدفون سامسونگ (ایربادز)", "هدفون شیائومی", "هدفون جی بی ال", "هدفون ریزر"],
        },
        {
          id: 14,
          title: "هدست",
        },
        {
          id: 15,
          title: "ساعت و مچ بند هوشمند",
          items: ["ساعت هوشمند سامسونگ", "ساعت هوشمند شیائومی", "اپل واچ", "بند اپل واچ", "بند ساعت هوشمند", "لوازم جانبی ساعت هوشمند"],
        },
        {
          id: 16,
          title: "دوربین",
          items: ["دوربین فیلمبرداری", "دوربین کنون", "دوربین سونی", "دوربین چاپ سریع"],
        },
        {
          id: 17,
          title: "تجهیزات ذخیره سازی اطلاعات",
          items: ["هارد ssd", "هارد اینترنال", "هارد اکسترنال", "هارد اکسترنال ssd"],
        },
        {
          id: 18,
          title: "فلش",
          items: ["فلش ۲۵۶ گیگ", "فلش ۱۲۸ گیگ", "فلش ۶۴ گیگ", "فلش ۳۲ گیگ", "فلش ۱۶ گیگ"],
        },
        {
          id: 19,
          title: "پاور بانک",
        },
        {
          id: 20,
          title: "باتری",
        },
        {
          id: 21,
          title: "پرینتر",
        },
        {
          id: 22,
          title: "ماشین های اداری",
        },
        {
          id: 23,
          title: "تجهیزات شبکه و ارتباطات",
          items: [
            "هاب USB",
            "سوییچ",
            "هاب سوئیچ",
            "تجهیزات ویدئویی",
            "کارت شبکه",
            "کامپیوتر سرور",
            "رک شبکه و سرور",
            "پچ پنل",
            "پرینت سرور",
            "آداپتور شبکه",
            "اسپلیتر",
            "کابل شبکه (LAN)",
            "کابل cat6",
            "کابل کمبو",
            "کارت و ماژول",
            "لوازم جانبی NAS و سرور",
            "ذخیره ساز تحت شبکه (NAS)",
            "یو پی اس (UPS)",
            "ابزار شبکه",
            "آنتن تقویتی",
            "مبدل فیبر نوری",
            "سیم آنتن",
          ],
        },
        {
          id: 24,
          title: "مودم",
          items: ["مودم جیبی", "مودم ایرانسل", "مودم همراه اول", "توسعه دهنده محدوده بی سیم", "روتر و اکسس پوینت"],
        },
        {
          id: 25,
          title: "تجهیزات امنیتی و نظارتی",
          items: ["دوربین مداربسته", "پایه دوربین مداربسته", "ماکت دوربین مداربسته"],
        },
        {
          id: 26,
          title: "تبلت",
        },
        {
          id: 27,
          title: "ایپد",
          items: ["ایپد ایر", "ایپد پرو"],
        },
        {
          id: 28,
          title: "خانه هوشمند",
        },
        {
          id: 29,
          title: "برند های برتر",
          items: ["شیائومی", "سامسونگ", "اپل", "هواوی", "آنر", "ریلمی", "توشیبا", "تکنو", "ایرانسل", "مبین نت", "نینتندو", "بیتس", "جی بی ال", "وان مور", "تی پی لینک", "دی لینک", "کیو سی وای"],
        },
        {
          id: 30,
          title: "داغ ترین ها",
          items: ["گیمینگ", "هدفون گربه ای", "فیفا", "مک بوک ایر m1", "مک بوک ایر m2", "مک بوک ایر m3", "مک بوک پرو m3", "مک پرو max m3", "مک بوک پرو m4", "سرفیس پرو ۱۱"],
        },
      ],
    },
    {
      id: 3,
      "main-title": "خانه و آشپزخانه",
      generalLink: "همه محصولات خانه و آشپزخانه",
      url: {
        base: null,
        uri: "/main/home-and-kitchen/",
      },
      image: "/images/logo/megamenu/furniture.svg",
      children: [
        {
          id: 1,
          title: "ظروف پخت و پز",
          items: ["قابلمه و تابه", "زودپز", "سرویس پخت و پز"],
        },
        {
          id: 2,
          title: "ابزار آشپزی",
          items: ["ست کفگیر و ملاقه", "چاقو", "تخته گوشت", "ظرف و قالب یخ", "قیف", "صافی", "گردوشکن", "فندک آشپزخانه", "ترازوی آشپزخانه"],
        },
        {
          id: 3,
          title: "تهیه و سرو چای و قهوه",
        },
        {
          id: 4,
          title: "ظروف آشپزخانه",
          items: ["آبکش و آبگیر", "بطری", "ارگانایزر آشپزخانه", "جای ادویه", "بانکه و ظروف بنشن", "شکرپاش و نمک پاش", "سبد آشپزخانه", "سبد سیب زمینی و پیاز", "ظرف نگهدارنده", "سایر ظروف"],
        },
        {
          id: 5,
          title: "لوازم تهیه کیک و دسر",
        },
        {
          id: 6,
          title: "سرو و پذیرایی",
          items: ["سفره", "ماگ", "سینی", "لیوان", "بشقاب", "قندان", "پارچ و بطری", "بستنی خوری", "سس خوری و آبلیمو خوری", "کلمن و فلاسک", "ظروف سرو و پذیرایی", "سرویس غذاخوری", "قاشق، چنگال و کارد", "زیرلیوانی، زیربشقابی و زیرقابلمه ای", "ابزار مهمانی"],
        },
        {
          id: 7,
          title: "منسوجات آشپزخانه",
        },
        {
          id: 8,
          title: "مبل",
          items: ["مبل راحتی", "مبل تختخواب شو", "مبل بادی", "مبل تدی", "مبل ال", "مبل مینیمال", "مبل چستر", "مبل اداری و صندلی انتظار", "پاف و بین بگ", "صندلی کودک"],
        },
        {
          id: 9,
          title: "دکوراسیون خانگی",
          items: ["کتابخانه", "شلف و طبقه", "کنسول", "صندلی", "میز نهارخوری"],
        },
        {
          id: 10,
          title: "مبلمان و دکوراسیون اداری",
        },
        {
          id: 11,
          title: "نگهدارنده لباس و لوازم",
        },
        {
          id: 12,
          title: "دکوراتیو",
        },
        {
          id: 13,
          title: "قاب عکس و تابلو",
        },
        {
          id: 14,
          title: "کوسن، رومیزی و شال مبل",
        },
        {
          id: 15,
          title: "کفپوش و دیوارپوش",
        },
        {
          id: 16,
          title: "نور و روشنایی",
        },
        {
          id: 17,
          title: "فرش و گلیم",
        },
        {
          id: 18,
          title: "گل و  گیاه",
        },
        {
          id: 19,
          title: "حمام",
        },
        {
          id: 20,
          title: "سرویس بهداشتی",
        },
        {
          id: 21,
          title: "خواب",
        },
        {
          id: 22,
          title: "شستشو و نظافت",
        },
        {
          id: 23,
          title: "نظافت لباس",
        },
      ],
    },
    {
      id: 4,
      "main-title": "لوازم خانگی برقی",
      generalLink: "همه محصولات لوازم خانگی برقی",
      url: {
        base: null,
        uri: "/landing/category-home-appliance/",
      },
      image: "/images/logo/megamenu/electrical.svg",
      children: [
        {
          id: 1,
          title: "صوتی و تصویری",
          items: ["تلویزیون", "ساندبار", "ویدئو پروژکتور", "اندروید باکس", "پخش کننده خانگی", "لوازم جانبی صوتی و تصویری", "ریموت کنترل", "میز تلویزیون"],
        },
        {
          id: 2,
          title: "تهویه، سرمایش و گرمایش",
          items: ["بخاری", "تصفیه کننده هوا", "بخاری برقی", "پکیج دیواری و رادیاتور", "شوفاژ برقی", "آبگرمکن", "پنکه", "کولر آبی", "کولر گازی"],
        },
        {
          id: 3,
          title: "تصفیه آب",
          items: ["فیلتر تصفیه آب"],
        },
        {
          id: 4,
          title: "یخچال فریزر",
          items: ["یخچال فریزر ساید بای ساید", "یخچال فریزر دوقلو", "یخچال فریزر هتلی", "یخچال فریزر کمبی"],
        },
        {
          id: 5,
          title: "جاروبرقی",
          items: ["جارو شارژی", "لوازم جانبی جاروبرقی و بخارشور", "جارو رباتیک"],
        },
        {
          id: 6,
          title: "بخار شو",
        },
        {
          id: 7,
          title: "ماشین لباسشویی",
          items: ["ماشین لباسشویی دوو", "ماشین لباسشویی پاکشوما", "ماشین لباسشویی اسنوا", "مینی واش"],
        },
        {
          id: 8,
          title: "ماشین ظرفشویی",
          items: ["ماشین ظرفشویی جی پلاس"],
        },
        {
          id: 9,
          title: "اتو",
          items: ["اتو بخار ایستاده", "اتو بخار", "بخارگر"],
        },
        {
          id: 10,
          title: "چرخ خیاطی",
          items: ["چرخ خیاطی ژانومه", "چرخ خیاطی کاچیران"],
        },
        {
          id: 11,
          title: "لواز پخت و پز",
          items: ["سرخ کن بدون روغن (air fryer)", "مایکروویو، مایکروفر", "اجاق گاز", "پلوپز", "ساندویچ ساز و وافل ساز", "آون توستر", "گریل و باربیکیو", "توستر"],
        },
        {
          id: 12,
          title: "نوشیدنی ساز",
          items: ["قهوه ساز", "اسپرسوساز", "چای ساز", "کتری برقی", "سماور برقی", "آبمیوه گیری", "آب مرکبات گیر", "آسیاب قهوه"],
        },
        {
          id: 13,
          title: "خردکن و غذاساز",
          items: ["گوشت کوب برقی", "غذاساز", "همزن", "مخلوط کن", "چرخ گوشت", "خردکن", "آسیاب"],
        },
        {
          id: 14,
          title: "لوازم توکار",
          items: ["فر", "هود", "گاز صفحه ای", "سینک ظرفشویی"],
        },
      ],
    },
    {
      id: 5,
      "main-title": "آرایشی بهداشتی",
      generalLink: "همه محصولات آرایشی بهداشتی",
      url: {
        base: null,
        uri: "/main/personal-appliance/",
      },
      image: "/images/logo/megamenu/cosmetics.svg",
      children: [
        {
          id: 1,
          title: "لوازم آرایشی",
          items: ["آرایش صورت", "آرایش چشم", "آرایش ابرو", "آرایش لب", "بهداشت و زیبایی ناخن", "ابزار آرایشی"],
        },
        {
          id: 2,
          title: "مراقبت پوست",
          items: ["ضدآفتاب", "کرم مرظوب کننده و نرم کننده", "ماسک صورت و بدن", "پاک کننده صورت", "تونر", "مراقبت بدن", "ابزار مراقبت پوست"],
        },
        {
          id: 3,
          title: "مراقبت و زیبایی مو",
          items: ["مراقبت مو", "آرایش مو", "نرم کننده مو", "شامپو مو"],
        },
        {
          id: 4,
          title: "لوازم بهداشتی",
          items: ["مراقبت دهان و دندان", "مسواک", "خمیر دندان", "دئودورانت و ضدتعریق", "محصولات بهداشت جنسی", "کاندوم", "بهداشت و مراقبت شخصی", "نوار بهداشتی", "کاپ قاعدگی", "لوازم اصلاح مو", "تیغ و یدک اصلاح"],
        },
        {
          id: 5,
          title: "عطر و ادوکلن",
          items: ["عطر و ادوکلن زنانه", "عطر و ادوکلن مردانه", "بادی اسپلش", "عطر جیبی"],
        },
        {
          id: 6,
          title: "لوازم شخصی برقی",
          items: ["سشوار", "اتو و حالت دهنده ی مو", "اصلاح موی صورت", "اصلاح موی سر"],
        },
      ],
    },
    {
      id: 6,
      "main-title": "خودرو و موتورسیکلت",
      generalLink: "همه محصولات خودرو و موتورسیکلت",
      url: {
        base: null,
        uri: "/main/vehicles-spare-parts/",
      },
      image: "/images/logo/megamenu/car.svg",
      children: [
        {
          id: 1,
          title: "لوازم مصرفی خودرو",
          items: ["روغن موتور", "فیلترها", "قطعات سرویسی", "روغن گیربکس", "روغن هیدرولیک", "ضدیخ و آب رادیاتور", "باتری", "لاستیک", "مکمل سوخت و روغن", "واکس و پولیش", "لوازم نظافت خودرو"],
        },
        {
          id: 2,
          title: "لوازم یدکی خودرو",
          items: ["لوازم بدنه", "چراغ", "آینه جانبی", "لوازم جلوبندی و تعلیق", "لوازم الکترونیکی", "لوازم مکانیکی"],
        },
        {
          id: 3,
          title: "لوازم صورتی و تصویری",
          items: ["دستگاه پخش", "بلندگو", "آمپلی فایر", "اف ام پلیر", "مسیریاب خودرو", "لوازم جانبی صوتی و تصویری"],
        },
        {
          id: 4,
          title: "لوازم جانبی خودرو",
          items: [
            "روکش صندلی",
            "کفپوش خودرو",
            "کفپوش صندوق خودرو",
            "عایق کاپوت،صندوق و دربها",
            "چادر خودرو",
            "تجهیزات نظم دهنده",
            "تجهیزات راحتی سرنشین",
            "لوازم ضدسرقت",
            "زنجیر چرخ",
            "دوربین ثبت وقایع خودرو",
            "پا رکابی",
            "اسپویلر و دیفیوزر",
            "هدلایت",
            "جاسوئیچی",
            "خوشبوکننده و تصفیه کننده هوای کابین",
            "باربند",
            "سر اگزوز",
            "سردنده",
            "لوازم تزئینی خودرو",
          ],
        },
        {
          id: 5,
          title: "لوازم موتورسیکلت",
          items: ["لوازم مصرفی", "لوازم یدکی", "لوازم جانبی", "لوازم ضدسرقت"],
        },
        {
          id: 6,
          title: "موتورسیکلت",
        },
        {
          id: 7,
          title: "خودرو",
          items: ["خودرو سدان", "شاسی و نیمه شاسی", "پیکاپ"],
        },
        {
          id: 8,
          title: "لوازم بر اساس نوع خودرو",
          items: ["206-207", "L90-ساندرو", "پرشیا-پژو 405", "پراید-تیبا", "سمند-دنا", "کوئیک-ساینا", "زانتیا-برلیانس", "MVM-فونیکس", "جک لیفان", "هیوندای کیا", "تویوتا-رنو"],
        },
      ],
    },
    {
      id: 7,
      "main-title": "ابزارآلات و تجهیزات",
      generalLink: "همه محصولات ابزارآلات و تجهیزات",
      url: {
        base: null,
        uri: "/main/vehicles/",
      },
      image: "/images/logo/megamenu/tools.svg",
      children: [
        {
          id: 1,
          title: "ابزار برقی",
          items: ["دریل، پیچ گوشتی و آچار بکس", "فرز و سنگ رومیزی", "موتور برق", "مکنده - دمنده", "جاروبرقی صنعتی", "کارواش", "دستگاه جوش", "هویه", "ابزار برش و تراشکاری", "کمپرسور هوا", "مولتی متر", "لوازم جانبی و یدکی ابزار برقی", "اره زنجیری"],
        },
        {
          id: 2,
          title: "ابزار غیر برقی",
          items: ["ابزار دستی", "مجموعه ابزار", "نردبان", "پیچ گوشتی و فازمتر", "نظم دهنده ابزار", "متر، تراز، اندازه گیری دقیق", "لوازم روانکاری", "چسب صنعتی", "انواع آچار و انبر", "پیچ و مهره، رول پلاک، میخ و پرچ", "مته و سری", "اره", "لوازم بسته بندی"],
        },
        {
          id: 3,
          title: "لوازم الکتریکی و یراق آلات",
          items: ["رنگ", "لوازم الکتریکی", "مصالح ساختمانی", "زنگ و دربازکن"],
        },
        {
          id: 4,
          title: "لوازم باغبانی و کشاورزی",
          items: ["ابزار باغبانی", "ادوات کشاورزی", "بذر و تخم گیاهان", "خاک، کود و آفت کش", "کاشت و پرورش گیاه"],
        },
        {
          id: 5,
          title: "تجهیزات ایمنی و کار",
          items: ["ماسک تنفسی", "لوازم آتش نشانی", "لوازم ایمنی و کار", "جعبه کمک های اولیه", "برچسب و علائم ایمنی"],
        },
        {
          id: 6,
          title: "حفاظتی و امنیتی",
          items: ["گاوصندوق", "قفل"],
        },
        {
          id: 7,
          title: "دستگاه های حمل و بالابر صنعتی",
          items: ["قطعات یدکی ماشین آلات صنعتی", "تجهیزات کارگاهی"],
        },
        {
          id: 8,
          title: "شیرآلات",
          items: ["ست شیرآلات", "شیر ظرفشویی", "شیر روشویی", "شیرآلات حمام", "شیر توالت", "اتصالات جانبی"],
        },
      ],
    },
    {
      id: 8,
      "main-title": "مد و پوشاک",
      generalLink: "همه محصولات مد و پوشاک",
      url: {
        base: null,
        uri: "/landing/apparel/",
      },
      image: "/images/logo/megamenu/clothing.svg",
      children: [
        {
          id: 1,
          title: "پوشاک مردانه",
        },
        {
          id: 2,
          title: "لباس مردانه",
          items: ["هودی مردانه", "سویشرت مردانه", "ژاکت و پلیور مردانه", "تی شرت مردانه", "پولوشرت مردانه", "پیراهن مردانه", "لباس زیر مردانه", "شلوار مردانه"],
        },
        {
          id: 3,
          title: "پالتو، بارانی و کاپشن مردانه",
          items: ["پالتو مردانه", "کاپشن مردانه", "کت چرم مردانه", "پافر مردانه"],
        },
        {
          id: 4,
          title: "کت، جلیقه و ست رسمی مردانه",
          items: ["کت تک مردانه", "کت شلوار مردانه", "جلیقه مردانه"],
        },
        {
          id: 5,
          title: "شلوار و سرهمی مردانه",
          items: ["شلوار جین مردانه", "لباس راحتی مردانه", "شلوارک مردانه", "جوراب مردانه", "شلوار اسلش مردانه", "شلوار مام استایل مردانه", "شلوار کارگو مردانه"],
        },
        {
          id: 6,
          title: "کیف مردانه",
          items: ["کیف پول مردانه"],
        },
        {
          id: 7,
          title: "کفش مردانه",
          items: ["نیم بوت مردانه", "بوت مردانه", "کفش اسپرت مردانه", "کفش کالج مردانه", "صندل مردانه", "دمپایی مردانه", "دمپایی لا انگشتی مردانه", "گیوه مردانه"],
        },
        {
          id: 8,
          title: "اکسسوری مردانه",
          items: ["ساعت مردانه", "عینک مردانه", "کمربند و ساسبند مردانه", "کلاه مردانه", "کراوات و پاپیون مردانه"],
        },
        {
          id: 9,
          title: "ورزشی مردانه",
          items: ["لباس ورزشی مردانه", "مایو مردانه", "گرمکن و ست ورزشی مردانه", "اکسسوری ورزشی مردانه", "کفش ورزشی مردانه"],
        },
        {
          id: 10,
          title: "پک هدیه مردانه",
        },
        {
          id: 11,
          title: "لباس زیر مردانه",
          items: ["زیرپوش مردانه", "شورت مردانه"],
        },
        {
          id: 12,
          title: "پوشاک زنانه",
        },
        {
          id: 13,
          title: "لباس زنانه",
          items: ["سویشرت زنانه", "هودی زنانه", "مانتو پانچو رویه", "تیشرت زنانه", "بلوز و شومیز زنانه", "تاپ و نیم تنه زنانه", "لباس راحتی زنانه", "لباس زیر زنانه", "دامن زنانه", "پیراهن و لباس مجلسی زنانه"],
        },
        {
          id: 14,
          title: "لباس خواب و راحتی زنانه",
          items: ["لباس خواب زنانه"],
        },
        {
          id: 15,
          title: "بلوز و شومیز زنانه",
          items: ["بادی زنانه", "ژاکت و پلیور زنانه", "تاپ و نیم تنه رویه", "تونیک زنانه", "تیشرت زنانه"],
        },
        {
          id: 16,
          title: "پالتو، بارانی و کاپشن زنانه",
          items: ["کاپشن زنانه", "پالتو زنانه", "کت چرم رویه", "بارانی زنانه", "پافر زنانه"],
        },
        {
          id: 17,
          title: "کت، جلیقه و ست رسمی زنانه",
        },
        {
          id: 18,
          title: "لباس زیر زنانه",
          items: ["شرت زنانه", "سوتین زنانه"],
        },
        {
          id: 19,
          title: "شلوار و سرهمی زنانه",
          items: ["شلوار جین زنانه", "لگینگ زنانه", "شلوارک زنانه", "شلوار کارگو زنانه", "شلوار بگ زنانه", "شلوار مام استایل زنانه"],
        },
        {
          id: 20,
          title: "مانتو زنانه",
        },
        {
          id: 21,
          title: "مقنعه و پوشیه",
        },
        {
          id: 22,
          title: "لباس بارداری",
          items: ["شلوار و سرهمی بارداری", "پیراهن و لباس مجلسی بارداری"],
        },
        {
          id: 23,
          title: "ورزشی زنانه",
        },
        {
          id: 24,
          title: "لباس ورزشی زنانه",
          items: ["گرمکن و ست ورزشی زنانه", "تاپ و نیم تنه ورزشی زنانه", "شلوار و سرهمی ورزشی زنانه", "مایو زنانه"],
        },
        {
          id: 25,
          title: "کفش زنانه",
          items: ["نیم بوت زنانه", "بوت زنانه", "کفش اسپرت زنانه", "کفش کالج زنانه", "صندل زنانه", "دمپایی لا انگشتی زنانه", "دمپایی زنانه", "گیوه زنانه"],
        },
        {
          id: 26,
          title: "کیف زنانه",
        },
        {
          id: 27,
          title: "اکسسوری زنانه",
          items: ["ساعت زنانه", "عینک زنانه", "کمربند زنانه"],
        },
        {
          id: 28,
          title: "ست هدیه زنانه",
        },
        {
          id: 29,
          title: "پوشاک بچگانه",
        },
        {
          id: 30,
          title: "ست راحتی و خواب بچگانه",
        },
        {
          id: 31,
          title: "کفش و ست ورزشی بچگانه",
        },
        {
          id: 32,
          title: "کیف و کوله و کفش بچگانه",
        },
        {
          id: 33,
          title: "دمپایی و صندل بچگانه",
        },
        {
          id: 34,
          title: "لباس پسرانه",
          items: ["تیشرت پسرانه", "شلوار و سرهمی جین پسرانه", "سویشرت و هودی پسرانه"],
        },
        {
          id: 35,
          title: "پوشاک دخترانه",
          items: ["پیراهن دخترانه", "ست لباس دخترانه", "سویشرت و هودی دخترانه", "شلوار و سرهمی جین دخترانه"],
        },
        {
          id: 36,
          title: "پوشاک نوزادی",
          items: ["ست لباس راحتی نوزاد", "بادی نوزاد", "ست نوزاد", "سرهمی نوزاد"],
        },
        {
          id: 37,
          title: "شلوار مام فیت",
        },
      ],
    },
    {
      id: 9,
      "main-title": "طلا و نقره",
      generalLink: "همه محصولات طلا و نقره",
      url: {
        base: null,
        uri: "/landing/gold-jwelery-category-page/",
      },
      image: "/images/logo/megamenu/gold.svg",
      children: [
        {
          id: 1,
          title: "شمش و پلاک طلا",
        },
        {
          id: 2,
          title: "سکه طلا",
          items: ["ربع سکه", "نیم سکه", "سکه تمام", "سکه پارسیان", "سکه قسطی"],
        },
        {
          id: 3,
          title: "طلای آب شده",
        },
        {
          id: 4,
          title: "طلای کم اجرت",
          items: ["گردنبند طلا کم اجرت (دست اول)", "النگو طلا کم اجرت (دست اول)", "دستبند طلا کم اجرت (دست اول)", "گوشواره طلا کم اجرت (دست اول)"],
        },
        {
          id: 5,
          title: "گردنبند طلا زنانه",
          items: ["گردنبند مرواری زنانه", "گردنبند چشم نظر", "گردنبند ونکلیف", "گردنبند اسم و حروف", "گردنبند کارتیر", "گردنبند ماه تولد", "گردنبند رولباسی"],
        },
        {
          id: 6,
          title: "زنجیر طلا",
          items: ["زنجیر فلامینگو", "زنجیر ونیزی", "زنجیر میرو", "زنجیر تیغ ماهی"],
        },
        {
          id: 7,
          title: "گوشواره طلا",
          items: ["گوشواره بخیه ای", "گوشواره کلیپسی", "گوشواره میخی", "گوشواره حلقه ای"],
        },
        {
          id: 8,
          title: "انگشتر طلا زنانه",
          items: ["انگشتر نگین دار", "انگشتر کارتیر", "انگشتر ونکلیف", "انگشتر ظریف", "انگشتر چشم نظر", "بندانگشتی طلا", "انگشتر مرواریدی", "انگشتر بدون نگین"],
        },
        {
          id: 9,
          title: "دستبند طلا زنانه",
          items: ["دستبند کارتیر", "دستبند چشم نظر", "دستبند مرواریدی", "دستبند چرم و طلا", "دستبند تیفانی", "دستبند اسم و حروف"],
        },
        {
          id: 10,
          title: "پابند طلا",
        },
        {
          id: 11,
          title: "پیرسینگ طلا زنانه",
        },
        {
          id: 12,
          title: "ست زیورآلات طلا زنانه",
        },
        {
          id: 13,
          title: "آویز ساعت طلا زنانه",
        },
        {
          id: 14,
          title: "زیورآلات طلا مردانه",
          items: ["انگشتر طلا مردانه", "زنجیر طلا مردانه", "گردنبند طلا مردانه", "دستبند طلا مردانه", "ست زیروآلات طلا مردانه", "دکمه سردست طلا مردانه", "جاکلیدی طلا مردانه"],
        },
        {
          id: 15,
          title: "زیورآلات طلا زنانه و مردانه",
        },
        {
          id: 16,
          title: "زیورآلات طلا بچگانه",
        },
        {
          id: 17,
          title: "زیورآلات طلا دخترانه",
          items: ["دستبند طلا دخترانه", "گوشواره طلا دخترانه", "ست زیروآلات طلا دخترانه", "گردنبند طلا دخترانه", "آویز طلا دخترانه", "انگشتر طلا دخترانه"],
        },
        {
          id: 18,
          title: "زیورآلات طلا پسرانه",
        },
        {
          id: 19,
          title: "زیورآلات طلا دخترانه و پسرانه",
          items: ["گل سینه طلا دخترانه و پسرانه"],
        },
        {
          id: 20,
          title: "النگو طلا زنانه",
        },
        {
          id: 21,
          title: "گل سینه طلا زنانه",
        },
        {
          id: 22,
          title: "زیورآلات نقره زنانه",
          items: ["انگشتر نقره زنانه", "دستبند نقره زنانه", "گردنبند نقره زنانه", "زنجیر نقره زنانه", "گوشواره نقره زنانه", "پابند نقره زنانه", "پیرسینگ نقره زنانه", "آویز نقره زنانه", "آویز ساعت نقره زنانه"],
        },
        {
          id: 23,
          title: "زیورآلات نقره مردانه",
          items: ["انگشتر نقره مردانه", "گردنبند نقره مردانه", "زنجیر نقره مردانه", "دستبند نقره مردانه"],
        },
        {
          id: 24,
          title: "آویز طلا زنانه",
          items: ["آویز گل طلا", "آویز ستاره طلا", "آویز پروانه طلا", "آویز قلب طلا", "آویز اسم طلا", "آویز طلای بی نهایت"],
        },
        {
          id: 25,
          title: "مستجابی (Mostajabi)",
        },
        {
          id: 26,
          title: "گالری طلا پرسته (Parasteh)",
        },
        {
          id: 27,
          title: "ماوی گالری (Mavi gallery)",
        },
        {
          id: 28,
          title: "تاج (Taj)",
        },
        {
          id: 29,
          title: "الی گالری",
        },
        {
          id: 30,
          title: "گالری روبی آرت (Ruby Art)",
        },
        {
          id: 31,
          title: "گالری شیدا مجد",
        },
        {
          id: 32,
          title: "هور گلد گالری",
        },
        {
          id: 33,
          title: "مه گلد گالری",
        },
        {
          id: 34,
          title: "مایاماهک (Maya Mahak)",
        },
        {
          id: 35,
          title: "طلای پارسیس",
        },
        {
          id: 36,
          title: "خانه سکه ایران (Iran Coin Hous)",
        },
        {
          id: 37,
          title: "دوست خوب (Doust Khoub)",
        },
        {
          id: 38,
          title: "اورل گالری",
        },
        {
          id: 39,
          title: "سهی (Sahi)",
        },
        {
          id: 40,
          title: "کاپانی",
        },
        {
          id: 41,
          title: "زیوتو",
        },
        {
          id: 42,
          title: "گلدم",
        },
        {
          id: 43,
          title: "درریس",
        },
        {
          id: 44,
          title: "ناریا",
        },
        {
          id: 45,
          title: "طلا و شمش برلیان",
        },
      ],
    },
    {
      id: 10,
      "main-title": "تجهیزات پزشکی و سلامت",
      generalLink: "همه محصولات تجهیزات پزشکی و سلامت",
      url: {
        base: null,
        uri: "/landing/medical-health-equipment/",
      },
      image: "/images/logo/megamenu/medical.svg",
      children: [
        {
          id: 1,
          title: "تجهیزات پزشکی",
          items: ["فشارسنج", "دماسنج محیطی", "ترازو", "تب سنج و دماسنج", "رطوبت گیر", "پد و کیسه آب گرم", "تشک و پتوی برقی", "ماسک تنفسی", "کیسه نمک-درد", "تجهیزات پزشکی حرفه ای", "لوازم پزشک"],
        },
        {
          id: 2,
          title: "تجهیزات پزشکی تنفسی",
          items: ["دستگاه بخور و رطوبت ساز", "دستگاه بخور سرد", "دستگاه بخور گرم", "پالس اکسیمتر", "تجهیزات کمکی تنفسی"],
        },
        {
          id: 3,
          title: "مکمل غذایی",
          items: ["مکمل کمک درمانی", "مکمل کودک و نوزاد", "اعصاب و روان", "بینایی", "بهداشت و سلامت جنسی", "پوست مو ناخن", "ترک اعتیاد", "تسکین درد", "سیستم ایمنی", "سرماخوردگی و آنفولانزا", "سیستم تنفسی و آلرژی", "سیستم گوارشی", "قلب و عروق", "کلیه و مجاری ادرار", "کنترل قند خون"],
        },
        {
          id: 4,
          title: "مکمل ورزشی",
          items: ["پروتئین", "آمینو اسید", "کراتین", "مکمل افزایش وزن", "مکمل کاهش وزن"],
        },
        {
          id: 5,
          title: "ویتامین",
          items: ["ویتامین C", "ویتامین D", "ویتامین B", "ویتامین D3", "ویتامین E", "ویتامین K", "امگا ۳"],
        },
        {
          id: 6,
          title: "مواد معدنی",
          items: ["قرص آهن", "قرص کلسیم", "قرص منیزیم", "قرص کروم", "قرص ید", "قرص زینک", "قرص سدیم", "قرص روی"],
        },
        {
          id: 7,
          title: "ارتوپدی و کمک درمانی",
        },
        {
          id: 8,
          title: "کنترل دیابت",
          items: ["دستگاه تست قند خون", "نوار تست قند خون", "سوزن تست قند خون", "سرنگ انسولین", "کیف خنک نگه دارنده انسولین"],
        },
        {
          id: 9,
          title: "لوازم پزشکی مصرفی",
        },
        {
          id: 10,
          title: "تجهیزات دندانپزشکی",
        },
        {
          id: 11,
          title: "ماساژور",
          items: ["ماساژور دستی", "صندلی ماساژور", "ماساژور برقی"],
        },
      ],
    },
    {
      id: 11,
      "main-title": "کتاب، لوازم تحریر و هنر",
      generalLink: "همه محصولات کتاب، لوازم تحریر و هنر",
      url: {
        base: null,
        uri: "/main/book-and-media/",
      },
      image: "/images/logo/megamenu/stationary.svg",
      children: [
        {
          id: 1,
          title: "کتاب و مجله",
          items: ["کتاب چاپی", "مجلات خارجی و داخلی"],
        },
        {
          id: 2,
          title: "محبوب ترین آثار",
          items: [
            "کتاب های سعدی",
            "کتاب های سعدی",
            "کتاب های سعدی",
            "کتاب های حافظ",
            "کتاب های خیام",
            "کتاب های فردوسی",
            "کتاب های مولانا",
            "کتاب های شهریار",
            "کتاب های فروغ فرخزاد",
            "کتاب های هوشنگ ابتهاج",
            "کتاب های سهراب سپهری",
            "کتاب های سیمین دانشور",
            "کتاب های جورج اورول",
            "کتاب های هری پاتر",
            "کتاب های آشپزی",
          ],
        },
        {
          id: 3,
          title: "کتاب صوتی",
        },
        {
          id: 4,
          title: "محتوای آموزشی",
          items: ["آموزش موسیقی", "آموزش ورزش و سرگرمی", "آموزش زبان", "آموزش نرم افزار و کامپیوتر"],
        },
        {
          id: 5,
          title: "نرم افزار",
        },
        {
          id: 6,
          title: "بازی کنسول و کامپیوتر",
        },
        {
          id: 7,
          title: "فیلم سینمایی، سریال و مستند",
        },
        {
          id: 8,
          title: "آلبوم موسیقی",
        },
        {
          id: 9,
          title: "لوازم تحریر",
          items: ["لوازم اداری و اقلام مصرفی", "کیف، کوله پشتی و جامدادی", "چراغ مطالعه", "کاغذ کادو، پاکت و کارت هدیه", "نوشت افزار", "دفتر و کاغذ", "خودکار و روان نویس", "ابزار نقاشی و رنگ آمیزی", "میز تحریر", "آلبوم عکس", "کاغذ چاپ و پرینتر", "مداد و مداد رنگی"],
        },
        {
          id: 10,
          title: "آلات موسیقی",
          items: ["لوازم جانبی آلات موسیقی", "گیتار", "کیبورد و ارگ", "پیانو دیجیتال", "درام، پرکاشن، دف", "تجهیزات استودیویی", "ویولن", "سازهای ایرانی"],
        },
        {
          id: 11,
          title: "فرش ماشینی، دستبافت، تابلو",
          items: ["فرش ماشینی", "فرش دستباف", "تابلو"],
        },
        {
          id: 12,
          title: "صنایع دستی",
          items: ["کالاهای مس", "سفال، سرامیک و چینی", "کیف چرمی", "ترمه، قلمکار و دستبافت", "خاتم، منبت، حصیری و چوبی", "تابلو و ساعت", "میناکاری", "فیروزه کوبی", "سوزن دوزی", "محصولات استخوانی", "جعبه و دست سازه های هنری"],
        },
      ],
    },
    {
      id: 12,
      "main-title": "ورزش و سفر",
      generalLink: "همه محصولات ورزش و سفر",
      url: {
        base: null,
        uri: "/main/sport-entertainment/",
      },
      image: "/images/logo/megamenu/sport.svg",
      children: [
        {
          id: 1,
          title: "پوشاک ورزشی مردانه",
        },
        {
          id: 2,
          title: "پوشاک ورزشی زنانه",
        },
        {
          id: 3,
          title: "کفش ورزشی مردانه",
          items: ["کفش فوتبال", "کفش فوتسال"],
        },
        {
          id: 4,
          title: "کفش ورزشی زنانه",
        },
        {
          id: 5,
          title: "پوشاک ورزشی پسرانه",
        },
        {
          id: 6,
          title: "پوشاک ورزشی دخترانه",
        },
        {
          id: 7,
          title: "کفش ورزشی پسرانه",
        },
        {
          id: 8,
          title: "کفش ورزشی دخترانه",
        },
        {
          id: 9,
          title: "تجهیزات سفر",
          items: ["ساک و چمدان", "کیف و کوله پشتی"],
        },
        {
          id: 10,
          title: "دوچرخه",
          items: ["دوچرخه کودک", "دوچرخه ۲۰", "دوچرخه ۲۴", "دوچرخه برقی", "لوازم جانبی دوچرخه"],
        },
        {
          id: 11,
          title: "کوهنوردی و کمپینگ",
          items: ["کفش کوهنوردی", "عصای کوهنوردی", "چراغ قوه و چراغ پیشانی", "چاقو و ابزار چندکاره", "قمقمه و فلاسک", "چادر", "کیسه خواب", "زیرانداز سفری", "تجهیزات جانبی سفر و کمپینگ", "میز و صندلی سفری"],
        },
        {
          id: 12,
          title: "چتر",
        },
        {
          id: 13,
          title: "ساک ورزشی",
        },
        {
          id: 14,
          title: "قمقمه و شیکر",
        },
        {
          id: 15,
          title: "لوازم ورزشی",
        },
        {
          id: 16,
          title: "ورزش های هوازی و بدنسازی",
          items: ["تجهیزات جانبی ایروبیک و تناسب اندام", "دمبل", "طناب", "بارفیکس", "تردمیل", "لوازم پوششی و محافظتی ورزشی"],
        },
        {
          id: 17,
          title: "ورزش های توپی",
          items: ["توپ", "راکت"],
        },
        {
          id: 18,
          title: "ورزش های آبی",
        },
        {
          id: 19,
          title: "ورزش های رزمی",
        },
        {
          id: 20,
          title: "اسکوتر برقی",
        },
        {
          id: 21,
          title: "اسکیت و اسکوتر",
        },
      ],
    },
    {
      id: 13,
      "main-title": "کارت هدیه و گیفت کارت",
      generalLink: "همه محصولات کارت هدیه و گیفت کارت",
      url: {
        base: null,
        uri: "/main/dk-ds-gift-card/",
      },
      image: "/images/logo/megamenu/giftcard.svg",
      children: [
        {
          id: 1,
          title: "کارت هدیه فیزیکی دیجیکالا",
        },
        {
          id: 2,
          title: "کارت هدیه برا اساس مناسب",
        },
        {
          id: 3,
          title: "کارت هدیه بر اساس قیمت",
        },
        {
          id: 4,
          title: "کارت هدیه الکترونیکی دیجی کالا",
        },
        {
          id: 5,
          title: "کارت هدیه الکترونیکی بر اساس مناسبت",
        },
        {
          id: 6,
          title: "کارت هدیه سازمانی",
        },
        {
          id: 7,
          title: "کارت هدیه مد و پوشاک",
        },
        {
          id: 8,
          title: "کارت هدیه اکسسوری مد و پوشاک",
        },
        {
          id: 9,
          title: "کارت هدیه دیجی استایل",
        },
        {
          id: 10,
          title: "کارت هدیه فیدیبو",
        },
        {
          id: 11,
          title: "گیفت کارت اپلیکیشن و نرم افزار",
        },
        {
          id: 12,
          title: "گیفت کارت پلتفرم های بازی",
        },
        {
          id: 13,
          title: "گیفت کارت پرداخت های درون بازی",
        },
        {
          id: 14,
          title: "گیفت کارت فروشگاه آنلاین",
        },
        {
          id: 15,
          title: "گیفت کارت فیلم و سریال",
        },
        {
          id: 16,
          title: "طلای دیجیتال",
        },
      ],
    },
    {
      id: 14,
      "main-title": "سوپرمارکت آنلاین",
      generalLink: "همه محصولات سوپرمارکت آنلاین",
      url: {
        base: null,
        uri: "/main/food-beverage/",
      },
      image: "/images/logo/megamenu/glocery.svg",
      children: [
        {
          id: 1,
          title: "کالاهای اساسی و خواروبار",
          items: ["ماکارونی", "برنج", "نبات", "قند", "شکر", "رب گوجه", "رب انار"],
        },
        {
          id: 2,
          title: "روغن",
          items: ["روغن مایع", "روغن جامد و نیمه جامد", "روغن زیتون", "روغن ذرت", "روغن کنجد", "روغن حیوانی"],
        },
        {
          id: 3,
          title: "چای و دمنوش",
        },
        {
          id: 4,
          title: "قهوه",
          items: ["دانه قهوه", "قهوه فوری", "قهوه اسپرسو"],
        },
        {
          id: 5,
          title: "غذاهای آماده و نیمه آماده",
          items: ["تن ماهی", "نودل", "عذاهای آماده کنسروی"],
        },
        {
          id: 6,
          title: "حبوبات و سویا",
        },
        {
          id: 7,
          title: "ادویه و افزودنی",
          items: ["زعفران", "زرشک", "فلفل", "نمک", "هل", "زنجبیل", "زردچوبه"],
        },
        {
          id: 8,
          title: "صبحانه",
          items: ["کره بادام زمینی", "شکلات صبحانه", "غلات صبحانه", "عسل"],
        },
        {
          id: 9,
          title: "نوشیدنی",
          items: ["شیرکاکائو", "آب معدنی", "نوشابه", "ماءالشعیر", "انرژی زا", "شربت و آبمیوه"],
        },
        {
          id: 10,
          title: "ترشی و شور",
        },
        {
          id: 11,
          title: "تنقلات",
          items: ["چیپس", "پفک", "تخمه", "لواشک", "کیک و کلوچه", "شکلات", "پاستیل", "آدامس", "بیسکویت"],
        },
        {
          id: 12,
          title: "آجیل",
          items: ["فندق", "پسته", "بادام درختی", "بادام هندی", "بادام زمینی", "انجیر"],
        },
        {
          id: 13,
          title: "شیرینی",
        },
        {
          id: 14,
          title: "خشکبار",
        },
        {
          id: 15,
          title: "مواد پروتئینی و تخم مرغ",
          items: ["خاویار", "سوسیس"],
        },
        {
          id: 16,
          title: "میوه و سبزیجات",
        },
        {
          id: 17,
          title: "بهداشت و نظافت خانگی",
          items: ["اسکاچ و سیم ظرفشویی", "دستکش نظافت", "مواد شوینده", "شوینده لباس", "شوینده ظروف", "شوینده سطوح", "مایع دستشویی", "شوینده فرش و مبل", "لوازم یکبار مصرف آشپزخانه"],
        },
        {
          id: 18,
          title: "بهداشت و خوراک کودک",
          items: ["غذای کودک", "پوشک کودک", "دهانشویه و خمیردندان کودک", "مسواک کودک", "دستمال مرطوب کودک", "کرم،بالم و لوسیون کودک", "شامپو کودک", "شوینده لباس کودک"],
        },
        {
          id: 19,
          title: "بهداشت شخصی",
        },
      ],
    },
    {
      id: 15,
      "main-title": "اسباب بازی، کودک و نوزاد",
      generalLink: "همه محصولات اسباب بازی، کودک و نوزاد",
      url: {
        base: null,
        uri: "/main/mother-and-child/",
      },
      image: "/images/logo/megamenu/baby.svg",
      children: [
        {
          id: 1,
          title: "بهداشت و حمام کودک و نوزاد",
          items: ["پوشک", "دستمال مرطوب", "حوله", "وان حمام نوزاد", "مینی واش", "شامپو کودک و نوزاد"],
        },
        {
          id: 2,
          title: "پوشاک و کفش کودک و نوزاد",
          items: ["لباس نوزادی", "کفش", "جوراب و پاپوش کودک و نوزاد", "کلاه و پیش بند نوزاد"],
        },
        {
          id: 3,
          title: "پوشاک بچگانه",
          items: ["پوشاک پسرانه", "لباس پسرانه", "لباس و کفش ورزشی پسرانه", "کفش پسرانه", "کوله پشتی پسرانه", "لباس دخترانه", "کفش دخترانه", "کوله پشتی دخترانه"],
        },
        {
          id: 4,
          title: "تبلت",
        },
        {
          id: 5,
          title: "پلی استیشن، ایکس باکس و بازی",
        },
        {
          id: 6,
          title: "اسباب بازی",
          items: ["فکری و آموزشی", "پازل، لگو و ساختنی", "عروسک و فیگور", "اسپینر، ابزار شوخی و سرگرمی", "تفنگ، تیر و لوازم جنگی"],
        },
        {
          id: 7,
          title: "بازی و سرگرمی کودک",
          items: ["ماشین بازی، موتور و سه چرخه", "دوچرخه", "تشک بازی و پارک بازی", "تاپ و سرسره"],
        },
        {
          id: 8,
          title: "سلامت، ایمنی و مراقبت",
          items: ["تصفیه هوا", "ترازو", "دوربین و پیجر اتاق کودک", "تب سنج و دماسنج", "محافظ و ابزار ایمنی"],
        },
        {
          id: 9,
          title: "خواب کودک",
          items: ["مبلمان اتاق کودک", "چراغ خواب کودک", "تشک کودک", "سرویس خواب", "پتو", "بالش شیردهی"],
        },
        {
          id: 10,
          title: "داغ ترین ها",
          items: ["عروسک سالیوان", "عروسک پاندا", "بازی منچ", "کیمدی شاپ", "کیمدی امضا شده", "خمیربازی"],
        },
        {
          id: 11,
          title: "ملزومات گردش و سفر",
          items: ["کالسکه و کریر", "صندلی خودرو و کودک و نوزاد", "ساک لوازم نوزاد", "لوازم جانبی گردش و سفر", "آغوشی"],
        },
        {
          id: 12,
          title: "لوازم شخصی",
          items: ["پستانک و ملزومات", "شیردوش", "شورت آموزشی"],
        },
        {
          id: 13,
          title: "غذاخوری",
          items: ["صندلی غذاخوری", "شیشه شیر، سرلاک و داروخوری"],
        },
      ],
    },
    {
      id: 16,
      "main-title": "محصولات بومی و محلی",
      generalLink: "همه محصولات محصولات بومی و محلی",
      url: {
        base: null,
        uri: "/main/rural-products/",
      },
      image: "/images/logo/megamenu/native.svg",
      children: [
        {
          id: 1,
          title: "موادغذایی ارگانیک",
        },
        {
          id: 2,
          title: "خواروبار محلی",
          items: ["برنج محلی", "روغن محلی"],
        },
        {
          id: 3,
          title: "صبحانه محلی",
          items: ["عسل طبیعی", "حلواشکری، ارده و کنجد سنتی"],
        },
        {
          id: 4,
          title: "کیک و شیرینی خانگی",
          items: ["شیرینی خانگی", "کیک و کلوچه محلی"],
        },
        {
          id: 5,
          title: "تنقلات خانگی",
          items: ["لواشک، برگه و آلوچه خانگی", "تخمه و مغز طعم دار محلی"],
        },
        {
          id: 6,
          title: "لبنیات سنتی",
          items: ["کره گیاهی و حیوانی محلی"],
        },
        {
          id: 7,
          title: "خشکبار و آجیل سنتی",
          items: ["آجیل سنتی", "خرمای محلی"],
        },
        {
          id: 8,
          title: "غلات و حبوبات ارگانیک",
          items: ["غلات ارگانیک", "حبوبات و سویا ارگانیک"],
        },
        {
          id: 9,
          title: "ادویه و چاشنی ارگانیک",
          items: ["ادویه های ارگانیک", "زعفران و زرشک ارگانیک"],
        },
        {
          id: 10,
          title: "عطاری",
        },
        {
          id: 11,
          title: "ترشیجات و شور خانگی",
        },
        {
          id: 12,
          title: "دکوراتیو سنتی",
          items: ["لوستر و چراغ آویز دست ساز", "مجسمه دست ساز", "گلدان دست ساز", "تابلو سنتی", "ست هدیه سنتی", "ست هفت سین سنتی", "کاشی سنتی", "آینه سنتی", "محصولات بافتنی"],
        },
        {
          id: 13,
          title: "خانه و کاشانه",
        },
        {
          id: 14,
          title: "نوشیدنی های ارگانیک",
          items: ["چای ارگانیک ایرانی", "دمنوش گیاهی"],
        },
        {
          id: 15,
          title: "اکسسوری و زیورآلات دست ساز",
        },
        {
          id: 16,
          title: "پوشاک بومی و محلی",
        },
        {
          id: 17,
          title: "قالی و قالیچه",
        },
        {
          id: 18,
          title: "ظروف سنتی",
          items: ["آجیل خوری سنتی", "دیس و سینی سنتی", "قندان سنتی", "بشقاب سنتی", "لیوان سنتی", "دیگ و قابلمه سنتی"],
        },
        {
          id: 19,
          title: "لوازم آشپزخانه سنتی",
          items: ["سبد دستباف", "هاون سنتی", "تخته سرو دست ساز"],
        },
        {
          id: 20,
          title: "رومیزی، رانر و زیربشقابی سنتی",
        },
      ],
    },
    {
      id: 17,
      "main-title": "کالای کارکرده",
      generalLink: "همه محصولات کالای کارکرده",
      url: {
        base: null,
        uri: "/landing/used/",
      },
      image: "/images/logo/megamenu/usedgoods.svg",
      children: [
        {
          id: 1,
          title: "موبایل کارکرده",
        },
        {
          id: 2,
          title: "لپ تاپ کارکرده",
        },
        {
          id: 3,
          title: "کنسول بازی کارکرده",
        },
        {
          id: 4,
          title: "ساعت هوشمند کارکرده",
        },
      ],
    },
  ];